-- MySQL dump 10.13  Distrib 8.4.3, for Win64 (x86_64)
--
-- Host: localhost    Database: acore_world
-- ------------------------------------------------------
-- Server version	8.4.3

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8mb4 */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `achievement_reward`
--

DROP TABLE IF EXISTS `achievement_reward`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `achievement_reward` (
  `ID` int unsigned NOT NULL DEFAULT '0',
  `TitleA` int unsigned NOT NULL DEFAULT '0',
  `TitleH` int unsigned NOT NULL DEFAULT '0',
  `ItemID` int unsigned NOT NULL DEFAULT '0',
  `Sender` int unsigned NOT NULL DEFAULT '0',
  `Subject` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci DEFAULT NULL,
  `Body` text CHARACTER SET utf8mb4 COLLATE utf8mb4_unicode_ci,
  `MailTemplateID` int unsigned NOT NULL DEFAULT '0',
  PRIMARY KEY (`ID`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci COMMENT='Loot System';
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `achievement_reward`
--

LOCK TABLES `achievement_reward` WRITE;
/*!40000 ALTER TABLE `achievement_reward` DISABLE KEYS */;
INSERT INTO `achievement_reward` VALUES
(13,0,0,41426,16128,'80级！','恭喜你在探险的过程中到达了80级，毫无疑问，你把自己所有精力都献身于同企图征服艾泽拉斯的恶魔做斗争的事业中去了，并且应该做到了不小的成就。$B$B你虽已到达80级，但还不是值得庆贺的时候，更大的挑战还在等待着你。$B$B继续战斗吧！$B$B罗宁',0),
(45,0,0,43348,28070,'你环游了世界！','嘿，伙计！$B$B我认为我已经在这片冰冻荒原找到一些值得庆祝的事情了！对于我这个矮人来说，我在你眼中很明显地看到探险家才有的激情。$B$B穿上这件战袍吧。这样当你的朋友要问路的时候就会想到你了！$B$B别停下脚步！$B$B布莱恩·铜须',0),
(46,78,78,0,0,'','',0),
(230,72,0,0,0,'','',0),
(418,62,62,0,0,'','',0),
(419,71,71,0,0,'','',0),
(420,80,80,0,0,'','',0),
(431,64,64,0,0,NULL,NULL,0),
(432,53,53,0,0,NULL,NULL,0),
(456,139,139,0,0,'','',0),
(614,0,0,44223,29611,'为了联盟！','战火席卷了我们的家园。只有最勇敢的英雄才敢向部落的要害进行直接的攻击，而你就是这些英雄中的一员。$B$B你对部落首领的突袭为我们打开了发动总攻的大门。部落将臣服在联盟脚下。$B$B你的努力将得到嘉奖，骄傲地继续前进吧！$B$B为了联盟！$B$B - 你的国王',0),
(619,0,0,44224,4949,'为了部落！','在这次行动中，伟大的勇士从苦难困苦中昂首站了起来——你就是其中之一。$B$B战争随时都会爆发，你的努力会为我们在艾泽拉斯的征程上画上浓重的一笔。你的勇敢必须要得到奖励，请收下这份来自奥格瑞玛的奖励，以彰显你的果敢！$B$B为了部落！$B$B - 大酋长萨尔',0),
(714,0,47,0,0,'','',0),
(762,0,130,0,0,'','',0),
(870,126,127,0,0,'','',0),
(871,144,144,0,0,'','',0),
(876,0,0,43349,29533,'我一直都在关注你，小子。','你在那座竞技场里打架确实很有一手。拿着这个，骄傲地戴着它。现在回去，让他们看看什么叫本事！$B$B萨尔大叔',0),
(907,48,0,0,0,'','',0),
(913,74,74,0,0,'','',0),
(942,79,0,0,0,'','',0),
(943,0,79,0,0,'','',0),
(945,131,131,0,0,'','',0),
(948,130,0,0,0,'','',0),
(953,132,132,0,0,'','',0),
(978,81,81,0,0,'','',0),
(1015,77,77,0,0,'','',0),
(1021,0,0,40643,29261,'成就卓著！','我注意到你收集了许多很棒的战袍，或许你想把这一件也锦上添花地加入你的收藏中。反正我留着它也没什么用。',0),
(1038,75,0,0,0,'','',0),
(1039,0,76,0,0,'','',0),
(1174,82,82,0,0,'','',0),
(1175,0,72,0,0,'','',0),
(1250,0,0,40653,28951,'臭臭的新家','我听说了你很喜欢养一些毛茸茸小动物的事，我希望你不会介意为我的臭臭找一个新家吧——它拒绝和我这里的小动物一起玩耍。$B$B如果你收下，请确保一天喂它两次。然后，嗯，它貌似对黑猫挺有兴趣的，虽然不知道为什么。$B$B - 布琳妮',0),
(1400,120,120,0,0,'','',0),
(1402,122,122,0,0,'','',0),
(1516,83,83,0,0,'','',0),
(1563,84,0,0,0,'','',0),
(1656,124,0,0,0,'','',0),
(1657,0,124,0,0,'','',0),
(1658,129,129,0,0,'','',0),
(1681,125,0,43300,7999,'来自达纳苏斯的问候','你的成就是意义重大且影响深远的。一直以来饱受折磨的艾泽拉斯因为你的这次行为而摆脱了恶魔的束缚。$B$B只有那些愿意花时间去了解我们土地的人才能明白我们的那些勇士为这片大陆前赴后继的意义，你是其中的一个。很高兴你能顺利结束你的探险，愿艾露恩祝福你。$B$B一切为了联盟，感谢你，博学者。$B$B - 泰兰德·语风',0),
(1682,0,125,43300,3057,'来自雷霆崖的问候','你的故事被广为流传， 犹如一股飓风席卷了整个大陆。那些敢于和恶魔战斗的人是我们唯一的期望。$B$B只有那些听懂风的语言的人才能明白我们欠那些为保护这片大陆而倒下的勇士们多少。希望你能把你探险的故事告诉更多像你这样活着的年轻人。然后我们就会记起来我们在这个世上有多少需要感谢。$B$B向你致以深深的感谢，博学者，大地母亲与你同在。$B$B为了部落！$B$B - 凯恩·血蹄',0),
(1683,0,133,0,0,'','',0),
(1684,133,0,0,0,'','',0),
(1691,0,134,0,0,'','',0),
(1692,134,0,0,0,'','',0),
(1693,0,135,0,0,'','',0),
(1707,135,0,0,0,'','',0),
(1784,0,84,0,0,'','',0),
(1793,138,137,0,0,'','',0),
(1956,0,0,43824,16128,'进修','恭喜你顺利完成了在达拉然魔法学院的进修工作。为了鼓励你所获得的成就，我把这部书籍邮寄给你，希望你能收下。$B$B我想，你应该能知道这份书籍的用途。$B$B向你致以真诚的问候。$B$B罗宁',0),
(2051,140,140,0,0,'','',0),
(2054,121,121,0,0,'','',0),
(2090,45,45,0,0,'','',0),
(2091,42,42,0,0,'','',0),
(2092,43,43,0,0,'','',0),
(2093,44,44,0,0,'','',0),
(2096,0,0,44430,29478,'金币达人','你好，恭喜你成功收集到了达拉然喷泉的所有硬币！为了表彰你的成就，我准备把这枚达拉然泰坦神铁徽记赠予你——这可是一枚我们只奖励给狂热硬币收集者的礼物。$B$B希望你会喜欢我这份特殊的礼物，现在，它是你的了！$B$B真挚地问候您。$B耶比托·乔巴斯',0),
(2136,0,0,44160,26917,'英雄的荣耀！','尊敬的勇士，$B$B你在诺森德英勇战斗的身影以及所获得的成就已经传到了龙眠神殿。$B$B你的勇敢不容忽视，请你务必接受这份礼物，和它一起，我们并肩驱逐诺森德的恶魔，一次亦或永远。$B$B阿莱克丝塔萨，生命的缚誓者',0),
(2143,0,0,44178,32216,'带领骑兵队','我发现你和你的坐骑们相处得好像挺不错的嘛，我每天都要对着这些牲畜简直烦躁死了。我想，你不会介意替我照看下这只白色幼龙吧？我只是抽不出空暇的时间来照顾这么多的坐骑了。$B$B梅尔·弗兰希斯',0),
(2144,0,0,44177,26917,'千奇百怪的漫长旅行','随着远方漫天战鼓的响起，对于你们这些艾泽拉斯的冒险者来说，忘记生命的意义是一件再正常不过的事情。$B$B从另一方面来说，你用你的所作所为来捍卫艾泽拉斯一个高贵种族的尊严，并且去记住我们为之奋斗的东西。不是为了庆祝我们的胜利，也许是我们在另一个方面的胜利更合适。记住你所做过的事情，冒险者。$B$B希望其他人会为你的行为而欢呼。$B$B阿莱克丝塔萨，生命的缚誓者',0),
(2145,0,0,44177,26917,'千奇百怪的漫长旅行','随着远方漫天战鼓的响起，对于你们这些艾泽拉斯的冒险者来说，忘记生命的意义是一件再正常不过的事情。$B$B从另一方面来说，你用你的所作所为来捍卫艾泽拉斯一个高贵种族的尊严，并且去记住我们为之奋斗的东西。不是为了庆祝我们的胜利，也许是我们在另一个方面的胜利更合适。记住你所做过的事情，冒险者。$B$B希望其他人会为你的行为而欢呼。$B$B阿莱克丝塔萨，生命的缚誓者',0),
(2186,141,141,0,0,'','',0),
(2187,142,142,0,0,'','',0),
(2188,143,143,0,0,'','',0),
(2336,145,145,0,0,'','',0),
(2516,0,0,44841,28951,'小宠物猎人','你好！$B$B我知道你已经给了淘气的臭臭一个温暖而又舒适的小窝，我希望你更加乐意收留这只迷你又可爱的小鹿。$B$B这只小鹿很害羞的，但是我想你用这个附赠的小鹿的盐块就能很轻易地和它建立起牢固的友情哦！$B$B - 布琳妮',0),
(2536,0,0,44843,32216,'堆积如山的坐骑','我听说现在你的坐骑数量几乎要和我一样多了，真令人钦佩啊！也许你能帮我一件事情，我这里有太多的龙鹰了，希望你能给它一个家？ 当然，它是被训练成一只合格的坐骑而不是，额，猎人的宠物。你会发现它的优点：不知疲倦，用不完的力气。哈哈。$B$B - 梅尔·弗兰希斯',0),
(2537,0,0,44842,32216,'堆积如山的坐骑','我听说现在你的坐骑数量几乎要和我一样多了，真令人钦佩啊！也许你能帮我一件事情，我这里有太多的龙鹰了，希望你能给它一个家？ 当然，它是被训练成一只合格的坐骑而不是，额，猎人的宠物。你会发现它的优点：不知疲倦，用不完的力气。哈哈。$B$B - 梅尔·弗兰希斯',0),
(2760,147,0,0,0,'','',0),
(2761,146,0,0,0,'','',0),
(2762,113,0,0,0,'','',0),
(2763,148,0,0,0,'','',0),
(2764,149,0,0,0,'','',0),
(2765,0,150,0,0,'','',0),
(2766,0,151,0,0,'','',0),
(2767,0,152,0,0,'','',0),
(2768,0,153,0,0,'','',0),
(2769,0,154,0,0,'','',0),
(2796,0,0,0,27487,'欢迎加入本月美酒俱乐部！','$N，$B$B   欢迎加入本月美酒俱乐部！俱乐部致力于为您提供世界各地最棒的美酒。$B$B   每个月我们都会为您寄送一份新酿。$B$B   $N，再次欢迎您的加入。$B$B - 本月美酒俱乐部',0),
(2797,155,0,0,0,'','',0),
(2798,0,155,0,0,'','',0),
(2816,0,156,0,0,'','',0),
(2817,156,0,0,0,'','',0),
(2903,161,161,0,0,'','',0),
(2904,160,160,0,0,'','',0),
(2957,0,0,45802,28070,'奥杜尔团队高手的荣耀','亲爱的$N，$B$B我希望你能继续努力加油，这样我们就能夺回对奥杜尔的控制权。$B$B我的那些探险者协会的小伙子们决定送你这只铁锈始祖幼龙作为你的奖励。$B$B我想你会很喜欢它吧。你们团队在奥杜尔的征程将铭记史册，继续奋斗吧。$B$B布莱恩·铜须',0),
(2958,0,0,45801,28070,'英雄：奥杜尔团队高手的荣耀','亲爱的$N，$B$B我希望你能继续努力加油，这样我们就能夺回对奥杜尔的控制权。$B$B我的那些探险者协会的小伙子们决定送你这只铁缚始祖幼龙作为你的奖励。$B$B我想你会很喜欢它吧。你们团队在奥杜尔的征程将铭记史册，继续奋斗吧。$B$B布莱恩·铜须',0),
(3036,164,164,0,0,'','',0),
(3037,165,165,0,0,'','',0),
(3117,158,158,0,0,'','',0),
(3259,159,159,0,0,'','',0),
(3316,166,166,0,0,'','',0),
(3336,157,157,0,0,'','',0),
(3436,167,167,0,0,'','',0),
(3478,168,0,44810,28951,'尚未被吃掉的土鸡','你能相信这只肥火鸡居然活着熬过了十一月吗？$N$N他的朋友们都已被端上丰盛大餐桌，配着蔓越莓酱和香料面包……唔……我都饿了。可是总之！他现在孤零零一个，所以我希望你能愿意照顾他。我的店里实在腾不出地方了！$N$N请务必让他远离烹饪用的火堆，一见到火他眼神就变得怪怪的……$N$N——布里安妮',0),
(3656,0,168,44810,28951,'不会咕咕的火鸡！','你能相信是这只滚圆的火鸡让整个十一月都洋溢着节日的气氛吗？$B$B好多朋友聚集在丰盛的饭桌前，上面放满了蔓越橘果酱、一片片切好的面包以及…哦哦哦…我感觉到自己都要流口水了！但是，它依然是孤零零的一只，所以我希望你能好好地照顾它，给它温暖——别吃掉它！虽然它也不会占多少地方，可是我店里早就已经拥挤不堪啦！$B$B嗯，记得让它远离烹饪用火，因为那些小火在它眼里是一种特殊的存在……',0),
(3758,169,169,0,0,'','',0),
(3857,0,0,49052,34924,'征服之岛的主人','荣耀属于你，$N，$B$B你在征服之岛的英雄表现，为军团做出了卓越的贡献，为此，送你这件战袍以示感谢。$B$B高级指挥官哈尔弗·维姆班恩',0),
(3957,0,0,49054,34922,'征服之岛的主人','尊敬的$N，$B$B在征服之岛的战场上，你英勇杀敌，功绩卓着，为你送上这件战袍是我的荣耀。$B$B阿格玛大王',0),
(4078,170,170,0,0,'','',0),
(4079,0,0,49098,36095,'大十字军的荣耀','亲爱的$N，$B$B你在大十字军竞技场的事迹这么久以来被反复传颂。大十字军竞技场是为了选拔以后进军冰冠堡垒的勇士而设立的一座竞技场，我希望有越来越多的勇士能在这座竞技场里脱颖而出，然后直捣冰冠堡垒。很显然，你引起了我的注意。$B$B我们需要你的力量来对抗巫妖王。不过这么些天来，你一直在举办庆祝活动，我也不好意思打扰你，现在把这匹最好的战马送给你，当天灾军团看到竖立在它后边的银白十字军战旗时，那胆战心惊的模样想必你也很乐意看到吧？$B$B荣耀伴随着你$B提里奥·弗丁',0),
(4080,171,171,0,0,'','',0),
(4156,0,0,49096,36095,'大十字军的荣耀','亲爱的$N，$B$B你在大十字军竞技场的事迹这么久以来被反复传颂。大十字军竞技场是为了选拔以后进军冰冠堡垒的勇士而设立的一座竞技场，我希望有越来越多的勇士能在这座竞技场里脱颖而出，然后直捣冰冠堡垒。很显然，你引起了我的注意。$B$B我们需要你的力量来对抗巫妖王。不过这么些天来，你一直在举办庆祝活动，我也不好意思打扰你，现在把这匹最好的战马送给你，当天灾军团看到竖立在它后边的银白十字军战旗时，那胆战心惊的模样想必你也很乐意看到吧？$B$B荣耀伴随着你$B提里奥·弗丁',0),
(4477,172,172,0,0,'','',0),
(4478,0,0,49912,32842,'小狗溜溜','这位耐心的朋友，$B$B您愿与可能不熟识的人一起下副本，我们对您的伟大表示崇高的敬意。如果你还带了带野队里的新手，那就更好了。$B$B长话短说，听说你喜欢组野队。那么我们就送您一只名叫溜溜的小狗，希望它能让你开心地完成一次野队之旅。$B$B/抱，$B$B魔兽世界开发团队',0),
(4530,175,175,0,0,'冰封王座（10人）','勇士们,你们在冰封王座上摧毁了巫妖王，黯刃骑士团佩服你们，这是我们给你的礼物!',0),
(4583,174,174,0,0,'冰河踏破者','勇士们,你们在冰封王座上摧毁了巫妖王，黯刃骑士团佩服你们，这是我们给你的礼物!',0),
(4584,173,173,0,0,'黎明之光','勇士们,你们在冰封王座上摧毁了巫妖王，黯刃骑士团佩服你们，这是我们给你的礼物!',0),
(4597,175,175,0,0,'冰封王座（25人）','勇士们,你们在冰封王座上摧毁了巫妖王，黯刃骑士团佩服你们，这是我们给你的礼物!',0),
(4598,176,176,0,0,'','',0),
(4599,177,177,0,0,'','',0),
(4602,0,0,51954,37120,'冰冠堡垒征服者的荣耀','$N，$B$B当巫妖王的影响力日渐薄弱的时候，有不少昔日在他麾下很强力的人脱离了他的控制。$B$B这只被我们捕获的冰霜巨龙就是一个很好的例子。它有强烈的自主意识，并且我们还有更多的这种巨龙。$B$B我们当中的一个人虽然在一次战斗中光荣地失去了一只胳膊，不过依然能很好的驾驭它——很明显，它被驯服的很好，并且给了他们自信。$B$B请接受这只来自黑锋骑士团的礼物，在这场伟大的战斗中有你们陪同，真的很荣幸。$B$B荣誉属于你们。$B大领主达里安·莫格莱尼',0),
(4603,0,0,51955,37120,'冰冠堡垒征服者的荣耀','$N，$B$B当巫妖王的影响力日渐薄弱的时候，有不少昔日在他麾下很强力的人脱离了他的控制。$B$B这只被我们捕获的冰霜巨龙就是一个很好的例子。它有强烈的自主意识，并且我们还有更多的这种巨龙。$B$B我们当中的一个人虽然在一次战斗中光荣地失去了一只胳膊，不过依然能很好的驾驭它——很明显，它被驯服的很好，并且给了他们自信。$B$B请接受这只来自黑锋骑士团的礼物，在这场伟大的战斗中有你们陪同，真的很荣幸。$B$B荣誉属于你们。$B大领主达里安·莫格莱尼',0),
(4784,0,0,0,37942,'银色领地的纹章收集者','朋友，你在诺森德所取得的成就令人不得不注目。$B$B用获取的纹章在达拉然兑换到各种强力的装备，然后武装自己，不是件很快乐的事么？$B$B我们就在达拉然的银色领地，在那儿，每种纹章都有对应的兑换师，来看看吧。$B$B我们期待你的到来！',0),
(4785,0,0,0,37941,'夺日者圣殿的纹章收集者','朋友，你在诺森德所取得的成就让人不得不注意。$B$B用获取的纹章在达拉然换取对应的装备，武装自己来更强大，不是每个人都乐意的么？$B$B在达拉然的夺日者圣殿，你能找到每一种纹章所对应的兑换师，在他的身上，你能收获许多。$B$B期待你的到来！',0);
/*!40000 ALTER TABLE `achievement_reward` ENABLE KEYS */;
UNLOCK TABLES;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2026-06-01 22:39:27
