DELETE FROM `coa_client_spell_description` WHERE `ID` IN (500919, 504912, 504913, 504914, 504915, 504916);
INSERT INTO `coa_client_spell_description` (`ID`, `Description`, `ToolTip`) VALUES
(500919, '向前旋转冲锋，对沿途的敌人造成 ${$m1+0+$AP*.15} 点物理伤害。\r\n\r\n定身时无法使用。\r\n\r\n2 次充能。6 秒冷却。', ''),
(504912, '向前旋转冲锋，对沿途的敌人造成 ${$m1+0+$AP*.15} 点物理伤害。\r\n\r\n定身时无法使用。\r\n\r\n2 次充能。6 秒冷却。', ''),
(504913, '向前旋转冲锋，对沿途的敌人造成 ${$m1+0+$AP*.15} 点物理伤害。\r\n\r\n定身时无法使用。\r\n\r\n2 次充能。6 秒冷却。', ''),
(504914, '向前旋转冲锋，对沿途的敌人造成 ${$m1+0+$AP*.15} 点物理伤害。\r\n\r\n定身时无法使用。\r\n\r\n2 次充能。6 秒冷却。', ''),
(504915, '向前旋转冲锋，对沿途的敌人造成 ${$m1+0+$AP*.15} 点物理伤害。\r\n\r\n定身时无法使用。\r\n\r\n2 次充能。6 秒冷却。', ''),
(504916, '向前旋转冲锋，对沿途的敌人造成 ${$m1+0+$AP*.15} 点物理伤害。\r\n\r\n定身时无法使用。\r\n\r\n2 次充能。6 秒冷却。', '');
